app/Controllers/Buku.php

    public function index()
    {
        $model = new BukuModel();
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $buku = $model->like('judul', $keyword)
                          ->orLike('penulis', $keyword)
                          ->findAll();
        } else {
            $buku = $model->findAll();
---
SELECT *
FROM `buku`