app/Controllers/Denda.php

SELECT `denda`.*, `peminjaman`.`id_user`
FROM `denda`
JOIN `peminjaman` ON `peminjaman`.`id_pinjam` = `denda`.`id_pinjam`
WHERE `peminjaman`.`id_user` = '2'
---
    public function index()
    {
        $userId = session('id_user');

        $data['denda'] = $this->dendaModel
            ->select('denda.*, peminjaman.id_user')
            ->join('peminjaman', 'peminjaman.id_pinjam = denda.id_pinjam')
            ->where('peminjaman.id_user', $userId)
            ->findAll();