app/Controllers/Peminjaman.php

UPDATE `peminjaman` SET `status` = 'menunggu_kembali'
WHERE `peminjaman`.`id_pinjam` IN ('143')
---
    public function konfirmasi_kembali($id)
    {
        if (session('role') != 'admin') return redirect()->to('/');
        $data = $this->peminjamanModel->find($id);

        if ($data) {
            $this->peminjamanModel->update($id, ['status' => 'kembali']);