app/Controllers/Peminjaman.php

    public function index()
    {
        $role = session()->get('role');
        $id_user = session()->get('id_user');

        $builder = $this->peminjamanModel
            ->select('
            peminjaman.*,
            users.nama,
            buku.judul,
            denda.denda as jumlah_denda
        ')
            ->join('users', 'users.id_user = peminjaman.id_user')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->join('denda', 'denda.id_pinjam = peminjaman.id_pinjam', 'left');

        if ($role != 'admin') {
            $builder->where('peminjaman.id_user', $id_user);
        }

        $data['peminjaman'] = $builder
            ->orderBy('peminjaman.id_pinjam', 'DESC')
            ->findAll();
---
SELECT `peminjaman`.*, `users`.`nama`, `buku`.`judul`, `denda`.`denda` as `jumlah_denda`
FROM `peminjaman`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
LEFT JOIN `denda` ON `denda`.`id_pinjam` = `peminjaman`.`id_pinjam`
WHERE `peminjaman`.`id_user` = '2'
ORDER BY `peminjaman`.`id_pinjam` DESC

    public function store()
    {
        $id_user = (session('role') == 'admin') ? $this->request->getPost('id_user') : session('id_user');
        $id_buku = $this->request->getPost('id_buku');

        // REVISI: Validasi denda saat menekan tombol simpan
        if (session('role') != 'admin') {
            $cekDenda = $this->dendaModel
                ->join('peminjaman', 'peminjaman.id_pinjam = denda.id_pinjam')
                ->where('peminjaman.id_user', $id_user)
                ->whereIn('denda.status', ['belum_bayar', 'menunggu_verifikasi'])
                ->first();

            if ($cekDenda) {
                return redirect()->to('/peminjaman')->with('error', 'buku tidak bisa di pinjam karna denda belum di bayar');
            }
        }

        // Lanjut proses simpan peminjaman
        $this->peminjamanModel->save([
            'id_user'         => $id_user,
            'id_buku'         => $id_buku,
            'tanggal_pinjam'  => date('Y-m-d'),
            'tanggal_kembali' => date('Y-m-d', strtotime('+7 days')),
            'status'          => 'pending'
        ]);

        return redirect()->to('/peminjaman')->with('success', 'Permintaan pinjam berhasil dikirim!');
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id_pinjam` = '143'

    public function konfirmasi_pinjam($id)
    {
        if (session('role') != 'admin') return redirect()->to('/');
        $data = $this->peminjamanModel->find($id);
        $buku = $this->bukuModel->find($data['id_buku']);

        if ($buku['stok'] > 0) {
            $this->peminjamanModel->update($id, ['status' => 'dipinjam']);
            $this->bukuModel->update($data['id_buku'], ['stok' => $buku['stok'] - 1]);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '1'
UPDATE `peminjaman` SET `status` = 'dipinjam', `tanggal_pinjam` = '2026-04-28', `tanggal_kembali` = '2026-05-05'
WHERE `peminjaman`.`id_pinjam` IN ('163')
UPDATE `buku` SET `stok` = 93
WHERE `buku`.`id_buku` IN ('1')