app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data['users'] = $this->users->findAll();