app/Models/usersmodel.php

SELECT *
FROM `users`
WHERE `username` = 'duyekadmin'
 LIMIT 1
---
    public function getUsersByUsername($username)
    {
        return $this->where('username', $username)->first();